{
  "<|endofpiece|>": 50007,
  "<|endoftext|>": 50000,
  "<|startofpiece|>": 50006,
  "[CLS]": 50002,
  "[MASK]": 50003,
  "[SEP]": 50001,
  "[UNK]": 50010,
  "[UNUSED1]": 50004,
  "[UNUSED2]": 50005,
  "[gMASK]": 50009,
  "[sMASK]": 50008
}
